InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ФинансовыеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЦенПродажи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЦеныНоменклатуры/Forms/ЗагрузкаЦенНоменклатуры/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьПрайсЛист(Команда)
	СкопироватьФайлНаСервер("ПостроительЗапроса");
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьФайлНаСервер(СпособЗагрузки)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("СкопироватьФайлНаСерверЗавершение", ЭтотОбъект, СпособЗагрузки);
	НачатьПомещениеФайлаНаСервер(ОповещениеОЗавершении,,,,,УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура СкопироватьФайлНаСерверЗавершение(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла <> Неопределено Тогда
		АдресФайлаВХранилище = ОписаниеПомещенногоФайла.Адрес;
		ЗагрузитьИзТабличногоДокументаНаСервере(АдресФайлаВХранилище, ДатаПрайсЛиста, ВидЦеныПродажи, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗагрузитьИзТабличногоДокументаНаСервере(АдресФайлаВХранилище, ДатаПрайсЛиста, ВидЦеныПродажи, ДополнительныеПараметры)
	
	Excel = ПрочитатьФайл(АдресФайлаВХранилище);
	ДополнительныеПараметры = "ТаблицаЗначений";
	ТаблицаПрайсЛиста  = ЗаполнитьТаблицуЗначенийИзТабличногоДокумента(Excel);
	
	Если ТаблицаПрайсЛиста.Количество() Тогда
		ЗагрузитьПрайсЛистПоставщика(ТаблицаПрайсЛиста, ДатаПрайсЛиста, ВидЦеныПродажи);
	Иначе
		ОбщегоНазначения.СообщитьПользователю("Выбранный файл не содержит строк с ценами!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаполнитьТаблицуЗначенийИзТабличногоДокумента(Excel)
	
	ТаблицаПрайсЛиста = Новый ТаблицаЗначений;
	ТаблицаПрайсЛиста.Колонки.Добавить("N", Новый ОписаниеТипов("Число"));
	ТаблицаПрайсЛиста.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(100)));
	ТаблицаПрайсЛиста.Колонки.Добавить("Код", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(9)));
	ТаблицаПрайсЛиста.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	
	КоличествоСтрок = Excel.ВысотаТаблицы;
	
	Для сч = 2 По КоличествоСтрок Цикл
		
		СтрокаПрайса = ТаблицаПрайсЛиста.Добавить();
		
		Попытка
			СтрокаПрайса.N = Число(Excel.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C1").ТекущаяОбласть.Текст);
			СтрокаПрайса.Код = Строка(Excel.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C3").ТекущаяОбласть.Текст);
			СтрокаПрайса.Номенклатура = Строка(Excel.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0") + "C2").ТекущаяОбласть.Текст);
			СтрокаПрайса.Цена = Число(Excel.ПолучитьОбласть("R" + Формат(сч, "ЧГ=0;") + "C4").ТекущаяОбласть.Текст);
		Исключение
			вызватьИсключение "Не удалось прочитать файл EXCEL в табличный документ!";
		КонецПопытки;
		
	КонецЦикла;
	
	возврат ТаблицаПрайсЛиста;
КонецФункции

&НаСервереБезКонтекста
Функция ПрочитатьФайл(АдресФайлаВХранилище)
	
	Excel = Новый ТабличныйДокумент;
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(".xlsx");
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВХранилище);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	Попытка
		Excel.Прочитать(ИмяВременногоФайла);
	Исключение
		вызватьИсключение "Не удалось прочитать файл EXCEL в табличный документ!";
	КонецПопытки;
	
	возврат Excel;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗагрузитьПрайсЛистПоставщика(ТаблицаПрайсЛиста, ДатаПрайсЛиста, ВидЦеныПродажи)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаПрайсЛиста", ТаблицаПрайсЛиста);
	
	Запрос.Текст="ВЫБРАТЬ
	|	ТаблицаПрайсЛиста.Номенклатура КАК Код,
	|	ТаблицаПрайсЛиста.Цена КАК Цена
	|ПОМЕСТИТЬ ВТ_ТаблицаПрайсЛиста
	|ИЗ
	|	&ТаблицаПрайсЛиста КАК ТаблицаПрайсЛиста
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТаблицаПрайсЛиста.Цена КАК Цена,
	|	Ном.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Ном
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаПрайсЛиста КАК ВТ_ТаблицаПрайсЛиста
	|		ПО Ном.Код = ВТ_ТаблицаПрайсЛиста.Код";
	
	
	
	ДанныеТаблицы = Запрос.Выполнить().Выгрузить();
	
	Попытка
		
		РегистрыСведений.ЦеныНоменклатуры.ЗаполнитьЦены(ДанныеТаблицы,ДатаПрайсЛиста,ВидЦеныПродажи);
		ОбщегоНазначения.СообщитьПользователю("Таблица успешно загружена.");
		
	Исключение
		
		ОбщегоНазначения.СообщитьПользователю("Произошла ошибка при записи цен в регистр!");
		
	КонецПопытки;
	
Конецпроцедуры
